samples/ITI-41_request_raw.xml

DefaultHttpRequest(chunked: false)
POST /PegIHE/tf7/services/XDSDocumentRepository?pServiceId=RepStandalone HTTP/1.1
requestType: ITI41
Access-Control-Allow-Origin: https://dev.avintis.com/ehgw/api
Access-Control-Allow-Methods: OPTION, GET, POST, DELETE, PATCH, PUT, HEAD
frameworkMessageId: b2275987-6393-4938-a5c9-a3ad12d5b297
frameworkMessageId_old: 2292d845-2ef3-4cf1-b55c-40bdba6f8c14
Access-Control-Allow-Headers: Authorization,Access-Control-Allow-Origin,Content-Type,Content-Length, X-Requested-With
Cache-Control: private
Access-Control-Allow-Credentials: true
frameworkContext: PostProcessing^WSO2^WSO2^PostProcessing_aInterface
OData-Version: 4.0
Expires: Thu, 01 Jan 1970 01:00:00 CET
frameworkTransactionId: 4798062b-3d14-4bd5-a76e-71f22a28bf27
CHARACTER_SET_ENCODING: utf-8
Content-Type: multipart/related; boundary="MIMEBoundary_05b39a33e8effeb90c1ccb1c58c4b93b5af2935a13853149"; type="application/xop+xml"; start="<0.15b39a33e8effeb90c1ccb1c58c4b93b5af2935a13853149@apache.org>"; start-info="application/soap+xml"; action="urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b"
Host: 10.2.101.10:11076
Connection: Keep-Alive
User-Agent: Synapse-PT-HttpComponents-NIO
Content-Length: 181931

--MIMEBoundary_05b39a33e8effeb90c1ccb1c58c4b93b5af2935a13853149
Content-Type: application/xop+xml; charset=utf-8; type="application/soap+xml"
Content-Transfer-Encoding: binary
Content-ID: <0.15b39a33e8effeb90c1ccb1c58c4b93b5af2935a13853149@apache.org>

<?xml version='1.0' encoding='utf-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"><saml2:Assertion xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:xsd="http://www.w3.org/2001/XMLSchema" ID="_73dc2647-739f-4e7d-b7a6-e219aad186c4" IssueInstant="2020-09-24T15:43:06.966Z" Version="2.0"><saml2:Issuer>http://ith-icoserve.com/eHealthSolutionsSTS</saml2:Issuer><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#_73dc2647-739f-4e7d-b7a6-e219aad186c4"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xsd"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><ds:DigestValue>mKxDkq41+L2zQrs7LZh+kZFwTOZT6gCRlKxPsV9D8qM=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>Iof2ntBB2HpHWl2AEeS4KOGjjRlEywzvEKYk/fbGuacqovmqrnh3ym3JXAzTXsfFyWlXWWlynJEU54a2JHlBL6FeMoDnxcBm8mFidkACkcNoK5FpqI6Skcs+oD/05+t9VIAxO2n8ODn1NN54/oX2jxw8aUO160Tl63QJUlhr2jiZKGAvFWAtXsHNXMiDX9A1b6crBJRwPVYV2Ged7IRGkVCqtRJkyP1pOM+TSCi4iR/YffeGYCFnmBk4xQ3zUZ6J7Y2ozytyTy/qyRNHhya/Vj27e8wPzvyaWlL71k1zJ/+CZOwlWbU4Gv8Sq4grmlqmYOLOjWZjt+aqfqDYIfz0VQ==</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509Certificate>MIID5jCCA0+gAwIBAgICANYwDQYJKoZIhvcNAQENBQAwRTELMAkGA1UEBhMCQ0gxDDAKBgNVBAoM
A0lIRTEoMCYGA1UEAwwfZWhlYWx0aHN1aXNzZS5paGUtZXVyb3BlLm5ldCBDQTAeFw0xOTExMTkw
NjE3MDBaFw0yOTExMTkwNjE3MDBaMDIxCzAJBgNVBAYTAkFUMRUwEwYDVQQKDAxJVEggaWNvc2Vy
dmUxDDAKBgNVBAMMA1NUUzCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBANc8txP/o03W
4+5FAzBsHGjT+2gKaWX4HgrMNWEmpavTaYPe8v7T8jYqvZbOHqdEYsZt4IflQSORpr9CM/Cbrd7y
WzwQ3fTs5bmIsFedAiRxSMli5d/7oBx0cwKv31OHzrB39PfkQstBKAm05qapY6H2mnf6yyWKCjbF
++YdQcsUVoTAAMwAIFFseDQEarCGAoD5Nd7rCeqasMVvTFobMxGhqntgiGlJbY+hNFyxz6dfVFtf
sTlHDdfqsak9Coj6DrSharBNHOg6RRiNvc3vJ/xUDWPtS+wjddz2hWiauh5xB+VA+cSu+QkCeM2c
f2yKV0FCV91dqSw2//sXCaaEP/8CAwEAAaOCAXIwggFuMEIGA1UdHwQ7MDkwN6A1oDOGMWh0dHBz
Oi8vY3RzLXBvc3Qua2VyZXZhbC5jb20vZ3NzL2NybC8yMi9jYWNybC5jcmwwQAYJYIZIAYb4QgEE
BDMWMWh0dHBzOi8vY3RzLXBvc3Qua2VyZXZhbC5jb20vZ3NzL2NybC8yMi9jYWNybC5jcmwwQAYJ
YIZIAYb4QgEDBDMWMWh0dHBzOi8vY3RzLXBvc3Qua2VyZXZhbC5jb20vZ3NzL2NybC8yMi9jYWNy
bC5jcmwwDAYDVR0TAQH/BAIwADAdBgNVHQ4EFgQUOZlov/TXB6YHUyMV1yWK2qjG0BswHwYDVR0j
BBgwFoAUKJfv3d4xWGxW8oZG4hHkPjhxXy8wDgYDVR0PAQH/BAQDAgTwMBEGCWCGSAGG+EIBAQQE
AwIF4DAzBgNVHSUELDAqBggrBgEFBQcDAgYIKwYBBQUHAwQGCisGAQQBgjcUAgIGCCsGAQUFBwMB
MA0GCSqGSIb3DQEBDQUAA4GBAIVAG7X24vwje17fcDshobEQ6SOV43JYYTUx5bfB6PRbiJOb8Kv9
2Ijs9o9JAuol1tisQ0LZX/ddEqZ02i3gw4HsC5PSX3pTvndbhRxC6qL9fGu8x2FJ2W3Os/au5WNP
VnLkX60dKe+2aMydlWxKAJiGZE10ppMXOV9GlVIiHysp</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature><saml2:Subject><saml2:NameID Format="urn:oasis:names:tc:SAML:2.0:nameid-format:persistent" NameQualifier="urn:gs1:gln">9801000050702</saml2:NameID><saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:bearer"><saml2:SubjectConfirmationData InResponseTo="Assertion_e2c58be04f4df2f80e9f3c0d1454878ee744aa3f" NotOnOrAfter="2020-09-24T15:58:06.966Z" Recipient="https://dev.avintis.com:9444/commonauth"/></saml2:SubjectConfirmation></saml2:Subject><saml2:Conditions NotBefore="2020-09-24T15:43:05.966Z" NotOnOrAfter="2020-09-24T15:58:06.966Z"><saml2:AudienceRestriction><saml2:Audience>urn:e-health-suisse:token-audience:all-communities</saml2:Audience></saml2:AudienceRestriction></saml2:Conditions><saml2:AuthnStatement AuthnInstant="2020-09-24T15:43:06.966Z"><saml2:AuthnContext><saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:PasswordProtectedTransport</saml2:AuthnContextClassRef></saml2:AuthnContext></saml2:AuthnStatement><saml2:AttributeStatement><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization"><saml2:AttributeValue xsi:type="xsd:string">Post CH AG</saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id"><saml2:AttributeValue xsi:type="xsd:anyURI">urn:oid:1.3.6.1.4.1.21367.2017.2.6.19.100.2</saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id"><saml2:AttributeValue xsi:type="xsd:string">Rosa Sestak</saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role"><saml2:AttributeValue><Role xmlns="urn:hl7-org:v3" code="HCP" codeSystem="2.16.756.5.30.1.127.3.10.6" codeSystemName="eHealth Suisse EPR Actors" displayName="Healthcare professional" xsi:type="CE"/></saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse"><saml2:AttributeValue><PurposeOfUse xmlns="urn:hl7-org:v3" code="NORM" codeSystem="2.16.756.5.30.1.127.3.10.5" codeSystemName="eHealth Suisse Verwendungszweck" displayName="Normal Access" xsi:type="CE"/></saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:resource:resource-id"><saml2:AttributeValue xsi:type="xsd:token">761337610410035724^^^&amp;2.16.756.5.30.1.127.3.10.3&amp;ISO</saml2:AttributeValue></saml2:Attribute><saml2:Attribute Name="urn:ihe:iti:xca:2010:homeCommunityId" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"><saml2:AttributeValue xsi:type="xsd:anyURI">urn:oid:1.3.6.1.4.1.21367.2017.2.6.19</saml2:AttributeValue></saml2:Attribute></saml2:AttributeStatement></saml2:Assertion></wsse:Security><wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b</wsa:Action><wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">d22ebb69-8368-4eb6-929b-b382f1b37c72</wsa:MessageID></soapenv:Header><soapenv:Body><xdsb:ProvideAndRegisterDocumentSetRequest xmlns:xdsb="urn:ihe:iti:xds-b:2007" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0">
  <lcm:SubmitObjectsRequest xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0">
    <rim:RegistryObjectList xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
      <rim:RegistryPackage id="6BCBAF38-3D23-CC4C-80F3-30779B1174E3" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:RegistryPackage">
        <rim:Slot name="submissionTime">
          <rim:ValueList>
            <rim:Value>20200924174309</rim:Value>
          </rim:ValueList>
        </rim:Slot>
        <rim:Name>
          <rim:LocalizedString value="DocumentSet"/>
        </rim:Name>
        <rim:Classification classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" classifiedObject="6BCBAF38-3D23-CC4C-80F3-30779B1174E3" id="517159EC-2731-F908-83DC-B90251B0E9AF" nodeRepresentation="424975005">
          <rim:Slot name="codingScheme">
            <rim:ValueList>
              <rim:Value>2.16.840.1.113883.6.96</rim:Value>
            </rim:ValueList>
          </rim:Slot>
          <rim:Name>
            <rim:LocalizedString value="Other EPD-document type"/>
          </rim:Name>
        </rim:Classification>
        <rim:Classification classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="6BCBAF38-3D23-CC4C-80F3-30779B1174E3" id="58089FCD-E400-D25A-73C2-2F6B5DCBBE2E" nodeRepresentation="" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
          <rim:Slot name="authorPerson">
            <rim:ValueList>
              <rim:Value>^Schulz^Max^^^</rim:Value>
            </rim:ValueList>
          </rim:Slot>
          <rim:Slot name="authorRole">
            <rim:ValueList>
              <rim:Value>Healthcare professional</rim:Value>
            </rim:ValueList>
          </rim:Slot>
          <rim:Name>
            <rim:LocalizedString value="XDSSubmissionSet.author"/>
          </rim:Name>
        </rim:Classification>
        <rim:Classification classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" classifiedObject="6BCBAF38-3D23-CC4C-80F3-30779B1174E3" id="B6E18810-CD5B-3DCB-1B07-E510FE593365" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"/>
        <rim:ExternalIdentifier id="013AD74B-3180-8B49-9D51-440F3C9B16B8" identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="6BCBAF38-3D23-CC4C-80F3-30779B1174E3" value="1.3.6.1.4.1.21367.2017.2.5.45">
          <rim:Name>
            <rim:LocalizedString value="XDSSubmissionSet.sourceId"/>
          </rim:Name>
        </rim:ExternalIdentifier>
        <rim:ExternalIdentifier id="1AF2498A-C98E-5123-970E-F28AC2BCC536" identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="6BCBAF38-3D23-CC4C-80F3-30779B1174E3" value="1.42.1.2018072257142615.7000">
          <rim:Name>
            <rim:LocalizedString value="XDSSubmissionSet.uniqueId"/>
          </rim:Name>
        </rim:ExternalIdentifier>
        <rim:ExternalIdentifier id="2A8B3E1A-203C-5313-1FAA-EA2577C235B6" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="6BCBAF38-3D23-CC4C-80F3-30779B1174E3" value="0936c240-486e-4839-a322-793de7185f99^^^&amp;1.3.6.1.4.1.21367.2017.2.5.45&amp;ISO">
          <rim:Name>
            <rim:LocalizedString value="XDSSubmissionSet.patientId"/>
          </rim:Name>
        </rim:ExternalIdentifier>
      </rim:RegistryPackage>
      <rim:ExtrinsicObject id="A4E2E0D2-0C34-19F4-9B0B-3ED15D71A546" mimeType="application/pdf" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1" status="urn:oasis:names:tc:ebxml-regrep:StatusType:Approved">
        <rim:Name>
          <rim:LocalizedString value="Test document"/>
        </rim:Name>
        >
        <rim:Slot name="languageCode">
          <rim:ValueList>
            <rim:Value>de-CH</rim:Value>
          </rim:ValueList>
        </rim:Slot>
        <rim:Slot name="creationTime">
          <rim:ValueList>
            <rim:Value>20200924174309</rim:Value>
          </rim:ValueList>
        </rim:Slot>
        <rim:Slot name="repositoryUniqueId">
          <rim:ValueList>
            <rim:Value>1.3.6.1.4.1.21367.2017.2.3.57</rim:Value>
          </rim:ValueList>
        </rim:Slot>
        <rim:Slot name="serviceStartTime">
          <rim:ValueList>
            <rim:Value>20180521</rim:Value>
          </rim:ValueList>
        </rim:Slot>
        <rim:Slot name="serviceStopTime">
          <rim:ValueList>
            <rim:Value>20180606</rim:Value>
          </rim:ValueList>
        </rim:Slot>
        <rim:Slot name="sourcePatientInfo">
          <rim:ValueList>
            <rim:Value>PID-8|male</rim:Value>
          </rim:ValueList>
        </rim:Slot>
        <rim:Slot name="sourcePatientId">
          <rim:ValueList>
            <rim:Value>0936c240-486e-4839-a322-793de7185f99^^^&amp;1.3.6.1.4.1.21367.2017.2.5.45&amp;ISO</rim:Value>
          </rim:ValueList>
        </rim:Slot>
        <rim:Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="A4E2E0D2-0C34-19F4-9B0B-3ED15D71A546" id="E0C43B15-229A-D665-6B45-A340E6C02AED" nodeRepresentation="417319006" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
          <rim:Slot name="codingScheme">
            <rim:ValueList>
              <rim:Value>2.16.840.1.113883.6.96</rim:Value>
            </rim:ValueList>
          </rim:Slot>
          <rim:Name>
            <rim:LocalizedString value="Record of health event (record artifact)"/>
          </rim:Name>
        </rim:Classification>
        <rim:Classification classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="A4E2E0D2-0C34-19F4-9B0B-3ED15D71A546" id="BFB4DF4A-B868-43CF-B4A4-1CFC4C849EDE" nodeRepresentation="17621005" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
          <rim:Slot name="codingScheme">
            <rim:ValueList>
              <rim:Value>2.16.840.1.113883.6.96</rim:Value>
            </rim:ValueList>
          </rim:Slot>
          <rim:Name>
            <rim:LocalizedString value="Technical user"/>
          </rim:Name>
        </rim:Classification>
        <rim:Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="A4E2E0D2-0C34-19F4-9B0B-3ED15D71A546" id="C4F066D3-EEE7-A18E-E324-642621B4A1E6" nodeRepresentation="urn:che:epr:EPR_Unstructured_Document" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
          <rim:Slot name="codingScheme">
            <rim:ValueList>
              <rim:Value>2.16.756.5.30.1.127.3.10.10</rim:Value>
            </rim:ValueList>
          </rim:Slot>
          <rim:Name>
            <rim:LocalizedString charset="UTF-8" value="Unstructured EPR document"/>
          </rim:Name>
        </rim:Classification>
        <rim:Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="A4E2E0D2-0C34-19F4-9B0B-3ED15D71A546" id="D83981AD-CA1E-8D30-2D47-7C95CCA35C87" nodeRepresentation="22232009" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
          <rim:Slot name="codingScheme">
            <rim:ValueList>
              <rim:Value>2.16.840.1.113883.6.96</rim:Value>
            </rim:ValueList>
          </rim:Slot>
          <rim:Name>
            <rim:LocalizedString value="Hospital (environment)"/>
          </rim:Name>
        </rim:Classification>
        <rim:Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="A4E2E0D2-0C34-19F4-9B0B-3ED15D71A546" id="22B7D0FC-8BEF-CA02-CE91-8D51501034E3" nodeRepresentation="394802001" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
          <rim:Slot name="codingScheme">
            <rim:ValueList>
              <rim:Value>2.16.840.1.113883.6.96</rim:Value>
            </rim:ValueList>
          </rim:Slot>
          <rim:Name>
            <rim:LocalizedString value="General medicine (qualifier value)"/>
          </rim:Name>
        </rim:Classification>
        <rim:Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="A4E2E0D2-0C34-19F4-9B0B-3ED15D71A546" id="6C4198FD-FA36-BE2C-A60A-B41A641BAE99" nodeRepresentation="721912009" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
          <rim:Slot name="codingScheme">
            <rim:ValueList>
              <rim:Value>2.16.840.1.113883.6.96</rim:Value>
            </rim:ValueList>
          </rim:Slot>
          <rim:Name>
            <rim:LocalizedString charset="UTF-8" value="Medication summary document (record artifact)"/>
          </rim:Name>
        </rim:Classification>
        <rim:Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="A4E2E0D2-0C34-19F4-9B0B-3ED15D71A546" id="F0410AF2-D25F-A2C3-5FCB-FDEAA7276858" nodeRepresentation="" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
          <rim:Slot name="authorPerson">
            <rim:ValueList>
              <rim:Value>^Schulz^Max^^^</rim:Value>
            </rim:ValueList>
          </rim:Slot>
          <rim:Slot name="authorRole">
            <rim:ValueList>
              <rim:Value>HCP</rim:Value>
            </rim:ValueList>
          </rim:Slot>
          <rim:Slot name="authorSpecialty">
            <rim:ValueList>
              <rim:Value>General Internal Medicine</rim:Value>
            </rim:ValueList>
          </rim:Slot>
          <rim:Name>
            <rim:LocalizedString value="XDSDocumentEntry.author"/>
          </rim:Name>
        </rim:Classification>
        <rim:ExternalIdentifier id="BD35CAC2-F290-7938-61FD-E90BE04AABEE" identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="A4E2E0D2-0C34-19F4-9B0B-3ED15D71A546" value="1.3.6.1.4.1.21367.2017.2.1.99.1.42.1.20112312375405215170610.8012">
          <rim:Name>
            <rim:LocalizedString value="XDSDocumentEntry.uniqueId"/>
          </rim:Name>
        </rim:ExternalIdentifier>
        <rim:ExternalIdentifier id="7DF56AE8-3673-2224-4E47-5C0838D8EC8B" identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="A4E2E0D2-0C34-19F4-9B0B-3ED15D71A546" value="0936c240-486e-4839-a322-793de7185f99^^^&amp;1.3.6.1.4.1.21367.2017.2.5.45&amp;ISO">
          <rim:Name>
            <rim:LocalizedString value="XDSDocumentEntry.patientId"/>
          </rim:Name>
        </rim:ExternalIdentifier>
      </rim:ExtrinsicObject>
      <rim:Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" id="5A36769E-DE9B-3A3F-9F37-CD6B962BAFB6" sourceObject="6BCBAF38-3D23-CC4C-80F3-30779B1174E3" targetObject="A4E2E0D2-0C34-19F4-9B0B-3ED15D71A546">
        <rim:Slot name="SubmissionSetStatus">
          <rim:ValueList>
            <rim:Value>Original</rim:Value>
          </rim:ValueList>
        </rim:Slot>
      </rim:Association>
    </rim:RegistryObjectList>
  </lcm:SubmitObjectsRequest>
  <xdsb:Document id="A4E2E0D2-0C34-19F4-9B0B-3ED15D71A546"><xop:Include href="cid:1.c5b39a33e8effeb94a97121c58c4b93b53d2935a13853149@apache.org"/></xdsb:Document>
</xdsb:ProvideAndRegisterDocumentSetRequest></soapenv:Body></soapenv:Envelope>
--MIMEBoundary_05b39a33e8effeb90c1ccb1c58c4b93b5af2935a13853149
Content-Type: application/octet-stream
Content-Transfer-Encoding: binary
Content-ID: <1.c5b39a33e8effeb94a97121c58c4b93b53d2935a13853149@apache.org>

<!-- binary document data ommitted -->

--MIMEBoundary_05b39a33e8effeb90c1ccb1c58c4b93b5af2935a13853149--
